{
    "enfermedades": {
        "dermatologia": {},

        "optometria": {
            "template": {
                "consulta": {
                    "tag": "consulta_template",
                    "pattern": [],
                    "responses": []
                },
                "sintomas": {
                    "tag": "sintomas_template",
                    "patterns": [],
                    "responses": []
                },
                "efectos": {
                    "tag": "efectos_template",
                    "patterns": [],
                    "responses": []
                },
                "tratamiento": {
                    "general": {
                        "tag": "tratamiento_general_template",
                        "patterns": [],
                        "responses": []
                    },
                    "adultos": {
                        "tag": "tratamiento_adultos_template",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "tratamiento_ninos_template",
                        "patterns": [],
                        "responses": []
                    }
                },
                "medicamentos": {
                    "general": {
                        "tag": "medicamentos_general_template",
                        "patterns": [],
                        "responses": []
                    },
                    "adultos": {
                        "tag": "medicamentos_adultos_template",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "medicamentos_ninos_template",
                        "patterns": [],
                        "responses": []
                    }
                },
                "complicaciones": {
                    "tag": "complicaciones_template",
                    "patterns": [],
                    "responses": []
                },
                "atencion_medica": {
                    "tag": "atencion_medica_template",
                    "patterns": [],
                    "responses": []
                },
                "prevencion": {
                    "tag": "prevencion_template",
                    "patterns": [],
                    "responses": []
                },
                "causas": {
                    "tag": "causas_template",
                    "patterns": [],
                    "responses": []
                }
            }
        },

        "neurocirugia": {},

        "psiquiatria": {},

        "cirugia_general": {},

        "oftalmologia": {
            "miopia": {
                "consulta": {
                    "tag": "consulta_miopia",
                    "pattern": ["¿Que es la miopia?", "Describe la miopia", "¿Como es la miopia?"],
                    "responses": [
                        "La miopía es un problema de refracción (forma en que la luz se refleja dentro del ojo) que hace que los objetos lejanos se vean borrosos. Pasa cuando la forma de su ojo hace que la luz se enfoque en un área enfrente de la retina (una capa de tejido sensible a la luz en la parte de atrás del ojo), en vez de enfocarse en la propia retina.", "Anomalía del ojo que produce una visión borrosa o poco clara de los objetos lejanos; se debe a una curvatura excesiva del cristalino que hace que las imágenes de los objetos se formen un poco antes de llegar a la retina."
                    ]
                },
                "sintomas": {
                    "tag": "sintomas_miopia",
                    "patterns": ["¿Cuales son los sintomas de la miopia?", "Sintomas de la miopia", "¿Que sintomas produce la miopia?"],
                    "responses": [
                        "Los síntomas más comunes de la miopía son: Problemas para ver cosas que están lejos, La necesidad de entrecerrar los ojos para ver claramente, Fatiga ocular.", 
                        "Entre los signos y síntomas de la miopía se pueden incluir los siguientes: visión borrosa al mirar objetos que están lejos, necesidad de entrecerrar los ojos para ver con claridad, dolores de cabeza, fatiga ocular"
                    ]
                },
                "efectos": {
                    "tag": "efectos_miopia",
                    "patterns": [],
                    "responses": []
                },
                "tratamiento": {
                    "general": {
                        "tag": "tratamiento_general_miopia",
                        "patterns": ["¿Cual es el tratamiento para la miopia?"],
                        "responses": [
                            "Los tratamientos más comunes para la miopía consisten en anteojos con prescripción médica o lentes de contacto. El oculista le recetará los anteojos adecuados para ayudarle a ver lo más claramente posible."
                        ]
                    },
                    "adultos": {
                        "tag": "tratamiento_adultos_miopia",
                        "patterns": ["¿Cual es el tratamiento para la miopia en adultos?"],
                        "responses": [
                            "Los adultos también pueden tener cirugía para tratar la miopía. La cirugía cambia la forma de su córnea para que pueda enfocar la luz claramente."
                        ]
                    },
                    "ninos": {
                        "tag": "tratamiento_ninos_miopia",
                        "patterns": [],
                        "responses": []
                    }
                },
                "medicamentos": {
                    "general": {
                        "tag": "medicamentos_general_miopia",
                        "patterns": [],
                        "responses": []
                    },
                    "adultos": {
                        "tag": "medicamentos_adultos_miopia",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "medicamentos_ninos_miopia",
                        "patterns": [],
                        "responses": []
                    }
                },
                "complicaciones": {
                    "tag": "complicaciones_miopia",
                    "patterns": ["¿Que puede ocasionar la miopia?", "¿Que complicaciones existen en una persona con miopia?"],
                    "responses": [
                        "La miopía se asocia con una variedad de complicaciones de leves a graves, como las siguientes: reducción de la calidad de vida, fatiga ocular, otros problemas de los ojos como el desprendimiento de retina, glaucoma, cataratas."
                    ]
                },
                "atencion_medica": {
                    "tag": "atencion_medica_miopia",
                    "patterns": ["¿Cuando debo consultar al medico?", "¿Es necesario ir al hospital?"],
                    "responses": [
                        "Debes buscar atención médica si presentas los siguientes síntomas: aparición repentina de muchas moscas volantes (motas o líneas diminutas que parecen ir a la deriva por el campo de visión), destellos de luz en uno o ambos ojos, una sombra gris parecida a una cortina que cubre todo o parte del campo de visión, una sombra en la visión exterior o lateral (visión periférica)."
                    ]
                },
                "prevencion": {
                    "tag": "prevencion_miopia",
                    "patterns": [],
                    "responses": []
                },
                "causas": {
                    "tag": "causas_miopia",
                    "patterns": ["¿Que causa la miopia?", "¿Como se genera la miopia?"],
                    "responses": [
                        "La miopía ocurre cuando el globo ocular crece demasiado largo, desde adelante hacia atrás, o cuando hay problemas con la forma de su córnea (la capa transparente frontal del ojo) o el cristalino (el “lente” interno que ayuda al ojo a enfocar)."
                    ]
                }
            },
            
            "cataratas": {
                "consulta": {
                    "tag": "consulta_cataratas",
                    "pattern": ["¿Que son las cataratas?"],
                    "responses": [
                        "Una catarata es una opacidad del cristalino, normalmente transparente, del ojo. Para las personas que tienen cataratas, ver a través de cristalinos opacos es algo parecido a mirar a través de una ventana escarchada o empañada.", 
                        "La catarata es una patología que consiste en la pérdida de transparencia del cristalino, la lente natural del ojo ya través de la cual pasan los rayos de luz hasta la retina y se forman las imágenes. Por esta razón, a medida que el cristalino se vuelve opaco, el paciente experimenta una pérdida progresiva de visión."
                    ]
                },
                "sintomas": {
                    "tag": "sintomas_cataratas",
                    "patterns": ["¿Que sintomas tiene la carata?", "¿Cuales son los sintomas que causan las cataratas?"],
                    "responses": [
                        "La visión borrosa o “ver nublado”, incluso “ver doble” es una sensación común entre quienes padecen esta patología",
                        "Algunos síntomas habituales son: La fotofobia, el empeoramiento de la visión en los días soleados, disminución de la sensibilidad a los colores, los contrastes, y el aumento de la miopía.",
                        "Los signos y síntomas de las cataratas incluyen los siguientes: visión nublada, borrosa o tenue, aumento de la dificultad con la visión por la noche, sensibilidad a la luz y al resplandor, necesidad de una luz más brillante para leer y para otras actividades, ver halos alrededor de las luces, cambios frecuentes en los anteojos o lentes de contacto recetados, decoloración o amarillamiento de los colores, visión doble en un solo ojo"
                    ]
                },
                "efectos": {
                    "tag": "efectos_cataratas",
                    "patterns": [],
                    "responses": []
                },
                "tratamiento": {
                    "general": {
                        "tag": "tratamiento_general_cataratas",
                        "patterns": ["¿Cual es el tratamiento para las cataratas?"],
                        "responses": [
                            "La única manera de eliminar la catarata es a través de una operación, siendo la técnica más habitual la facoemulsificación. Esta consiste en deshacer la catarata y aspirarla, bien sea a través del método convencional por ultrasonidos o con el nuevo láser de femtosegundo, que también se utiliza para la cirugía refractiva o los trasplantes de córnea."
                        ]
                    },
                    "adultos": {
                        "tag": "tratamiento_adultos_cataratas",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "tratamiento_ninos_cataratas",
                        "patterns": [],
                        "responses": []
                    }
                },
                "medicamentos": {
                    "general": {
                        "tag": "medicamentos_general_cataratas",
                        "patterns": [],
                        "responses": []
                    },
                    "adultos": {
                        "tag": "medicamentos_adultos_cataratas",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "medicamentos_ninos_cataratas",
                        "patterns": [],
                        "responses": []
                    }
                },
                "complicaciones": {
                    "tag": "complicaciones_cataratas",
                    "patterns": [],
                    "responses": []
                },
                "atencion_medica": {
                    "tag": "atencion_medica_cataratas",
                    "patterns": ["¿Cuando debo consultar a un medico?", "¿Cuando debo asistir a un hospital?", "¿Cuando debo buscar asistencia medica?"],
                    "responses": [
                        "Pida cita médica para un examen ocular si nota algún cambio en su visión. Si presentas cambios repentinos en la visión, como visión doble o destellos de luz, dolor ocular repentino o dolor de cabeza repentino, acuda al médico de inmediato."
                    ]
                },
                "prevencion": {
                    "tag": "prevencion_cataratas",
                    "patterns": ["¿Como se puede prevenir la catarata?", "¿Como puedo evitar tener catarata?"],
                    "responses": [
                        "La catarata no se puede evitar, pero sí que se puede detectar y tratar precozmente antes de que siga evolucionando y merme considerablemente la visión y la calidad de vida del paciente, de forma que se puede llegar a reducir hasta un 30% el riesgo de caídas.",
                        "Ningún estudio ha demostrado cómo prevenir las cataratas o hacer más lento su avance. Sin embargo, los médicos creen que varias estrategias pueden ser útiles, entre ellas: hacerse exámenes de la vista regulares, dejar de fumar, eligir una dieta saludable con muchas frutas y vegetales, usar lentes de sol, y reducir el consumo de bebidas alcoholicas."
                    ]
                },
                "causas": {
                    "tag": "causas_cataratas",
                    "patterns": ["¿Que causa las cataratas?"],
                    "responses": [
                        "El envejecimiento es la principal causa de esta enfermedad, fruto del proceso degenerativo natural del ojo. Este se activa, generalmente, a partir de los 40 años y hace que el cristalino sea cada vez menos transparente.",
                        "Asímismo, existen otros factores ajenos a la edad que pueden provocar una catarata como los: traumatismos, la miopía, la diabetes, consumo de fármacos como la corticoides, o condiciones genéticas.",
                        "Las cataratas también pueden provocarse por otras afecciones oculares, cirugías oculares anteriores o afecciones médicas como la diabetes. El uso prolongado de medicamentos esteroides también puede provocar el desarrollo de cataratas."
                    ]
                }
            }
        },

        "medicina_alternativa": {},

        "virologia": {},

        "hematologia": {
            "leucemia": {
                "consulta": {
                    "tag": "consulta_leucemia",
                    "pattern": ["¿Que es la leucemia?", "Describe la leucemia"],
                    "responses": [
                        "La leucemia es un cáncer de la sangre. Se trata de la proliferación incontrolada y excesiva de glóbulos blancos anómalos en la medula ósea, que se adueñan de ella e impiden la producción de las restantes células normales (plaquetas y glóbulos rojos), al tiempo que invaden la sangre y otros órganos.",
                        "La leucemia es el cáncer de los tejidos que forman la sangre en el organismo, incluso la médula ósea y el sistema linfático."
                    ]
                },
                "sintomas": {
                    "tag": "sintomas_leucemia",
                    "patterns": ["¿Cuales son los sintomas de la leucemia?", "¿Que sintomas produce la leucemia?"],
                    "responses": [
                        "Los signos y síntomas comunes incluyen los siguientes: fiebre o escalofríos, fatiga persistente, debilidad, infecciones frecuentes o graves, pérdida de peso sin intentarlo, ganglios linfáticos inflamados, agrandamiento del hígado o del bazo, sangrado y formación de hematomas con facilidad, sangrados nasales recurrentes, pequeñas manchas rojas en la piel (petequia), hiperhidrosis, sobre todo por la noche, dolor o sensibilidad en los huesos",
                        "En general, las leucemias agudas se manifiestan con los siguientes síntomas: cansancio y debilidad, fiebre, sudores, pérdida de apetito y de peso, anemia, hematomas en la piel, sangrado por la nariz o las encías, menstruaciones  exageradas: por la falta de plaquetas, infecciones recurrentes: como neumonías o amigdalitis, debido a la falta de glóbulos blancos."
                    ]
                },
                "efectos": {
                    "tag": "efectos_leucemia",
                    "patterns": [],
                    "responses": []
                },
                "tratamiento": {
                    "general": {
                        "tag": "tratamiento_general_leucemia",
                        "patterns": ["¿Como se trata la leucemia?", "¿Cual es el tratamiento para la leucemia?"],
                        "responses": [
                            "Sin tratamiento, la leucemia es una enfermedad rápidamente mortal. Y este siempre tiene que establecerse según el tipo de leucemia que afecte al paciente, su edad y su estado general de  salud. Se pueden distinguir los siguientes: quimioterapia, radioterapia y trasplante de médula ósea."
                        ]
                    },
                    "adultos": {
                        "tag": "tratamiento_adultos_leucemia",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "tratamiento_ninos_leucemia",
                        "patterns": [],
                        "responses": []
                    }
                },
                "medicamentos": {
                    "general": {
                        "tag": "medicamentos_general_leucemia",
                        "patterns": ["¿Cuándo debo consultar al médico?", "¿Cuando debo buscar asistencia medica?"],
                        "responses": [
                            "Pide una cita con el médico si tienes síntomas o signos persistentes que te preocupen. Los síntomas de la leucemia suelen ser imprecisos y poco específicos. Es posible que pases por alto los síntomas tempranos de la leucemia porque se parecen a los de la gripe y de otras enfermedades comunes.",
                            ""
                        ]
                    },
                    "adultos": {
                        "tag": "medicamentos_adultos_leucemia",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "medicamentos_ninos_leucemia",
                        "patterns": [],
                        "responses": []
                    }
                },
                "complicaciones": {
                    "tag": "complicaciones_leucemia",
                    "patterns": [],
                    "responses": []
                },
                "atencion_medica": {
                    "tag": "atencion_medica_leucemia",
                    "patterns": ["¿Cuándo debo consultar al médico?", "¿Cuando debo buscar asistencia medica?"],
                    "responses": [
                        "Pide una cita con el médico si tienes síntomas o signos persistentes que te preocupen. Los síntomas de la leucemia suelen ser imprecisos y poco específicos. Es posible que pases por alto los síntomas tempranos de la leucemia porque se parecen a los de la gripe y de otras enfermedades comunes."
                    ]
                },
                "prevencion": {
                    "tag": "prevencion_leucemia",
                    "patterns": [],
                    "responses": []
                },
                "causas": {
                    "tag": "causas_leucemia",
                    "patterns": ["¿Que causa la leucemia?"],
                    "responses": [
                        "Algunos factores ambientales relacionados con la aparición de la leucemia son: exposición a radiaciones ionizantes, exposición a las radiaciones, enfermedades congénitas o hereditarias."
                    ]
                }
            },

            "linfoma": {
                "consulta": {
                    "tag": "consulta_linfoma",
                    "pattern": ["¿Que es el linfoma?"],
                    "responses": [
                        "El linfoma es un cáncer que se desarrolla en las células blancas del sistema linfático. Los síntomas pueden incluir ganglios linfáticos agrandados, pérdida de peso inexplicable, fatiga, sudoración y falta de aliento nocturnos, tos, o problemas para respirar.",
                        "El linfoma es un tipo de cáncer del sistema linfático, que es parte de la red del organismo que combate los gérmenes. El sistema linfático comprende los ganglios linfáticos (glándulas linfáticas), el bazo, el timo y la médula ósea. El linfoma puede afectar todas esas zonas, así como otros órganos del cuerpo."
                    ]
                },
                "sintomas": {
                    "tag": "sintomas_linfoma",
                    "patterns": ["¿Cuales son los sintomas del linfoma?"],
                    "responses": [
                        "Los signos y síntomas del linfoma pueden incluir: hinchazón indolora de los ganglios linfáticos en el cuello, las axilas o la ingle, fatiga persistente, fiebre, sudores nocturnos, dificultad para respirar, pérdida de peso sin causa aparente, picazón en la piel",
                        "Los síntomas del linfoma pueden incluir: agrandamiento de los ganglios linfáticos en el cuello, las axilas o la ingle, pérdida inexplicable de peso, fiebre, transpiración nocturna desmedida, picazón generalizada, fatiga, pérdida del apetito, tos o dificultad para respirar, dolor en el abdomen, el pecho o los huesos"
                    ]
                },
                "efectos": {
                    "tag": "efectos_linfoma",
                    "patterns": [],
                    "responses": []
                },
                "tratamiento": {
                    "general": {
                        "tag": "tratamiento_general_linfoma",
                        "patterns": ["¿Como se trata el linfoma?"],
                        "responses": [
                            "Cuando se requiere un tratamiento para el linfoma, se pueden utilizar uno o más de los siguientes tratamientos: quimioterapia, profilaxis del SNC, radioterapia, terapia con anticuerpos monoclonales, radioinmunoterapia, terapia biológica, transplante de células madre."
                        ]
                    },
                    "adultos": {
                        "tag": "tratamiento_adultos_linfoma",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "tratamiento_ninos_linfoma",
                        "patterns": [],
                        "responses": []
                    }
                },
                "medicamentos": {
                    "general": {
                        "tag": "medicamentos_general_linfoma",
                        "patterns": [],
                        "responses": []
                    },
                    "adultos": {
                        "tag": "medicamentos_adultos_linfoma",
                        "patterns": [],
                        "responses": []
                    },
                    "ninos": {
                        "tag": "medicamentos_ninos_linfoma",
                        "patterns": [],
                        "responses": []
                    }
                },
                "complicaciones": {
                    "tag": "complicaciones_linfoma",
                    "patterns": [],
                    "responses": []
                },
                "atencion_medica": {
                    "tag": "atencion_medica_linfoma",
                    "patterns": [],
                    "responses": []
                },
                "prevencion": {
                    "tag": "prevencion_linfoma",
                    "patterns": [],
                    "responses": []
                },
                "causas": {
                    "tag": "causas_linfoma",
                    "patterns": ["¿Que causa el linfoma?"],
                    "responses": [
                        "El linfoma comienza cuando un glóbulo blanco que combate enfermedades, llamado linfocito, sufre una mutación genética. La mutación le dice a la célula que se multiplique rápidamente, y se crean muchos linfocitos enfermos que continúan multiplicándose. La mutación también permite que las células sigan viviendo cuando otras células normales morirían. Esto produce demasiados linfocitos enfermos e ineficaces en los ganglios linfáticos y hace que los ganglios linfáticos, el bazo y el hígado se hinchen."
                    ]
                }
            }
        },

        "bioquimica": {},

        "radiologia": {},

        "cirugia_plastica": {},

        "ortopedia": {},

        "obstetricia": {},

        "pediatria": {},

        "geriatria": {}
    }
}
